; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v3)
             (pred_4 ?v7 ?v4)
             (pred_7 ?v13 ?v4)
             (pred_10 ?v12 ?v13 )
	     (pred_1 ?v13)
             (pred_9 ?v5)
             (pred_6 ?v7)
             (pred_5 ?v4)
             (pred_12 ?v13)
             (pred_2 ?v7)
             (pred_11 ?v13)
             (pred_8 ))



(:action op_4
:parameters (?v9 ?v11 ?v6 ?v2)
:precondition (and (pred_9 ?v9) (pred_9 ?v11) (pred_6 ?v6) (pred_5 ?v2)
          (pred_3 ?v9 ?v11) (pred_4 ?v6 ?v2)
                   (pred_7 ?v11 ?v2) (pred_1 ?v9) 
                   (pred_12 ?v11) (pred_2 ?v6))
:effect (and  (pred_11 ?v11) (not (pred_12 ?v11))))


(:action op_5
:parameters (?v9 ?v1)
:precondition (and (pred_9 ?v9) (pred_9 ?v1)
               (pred_1 ?v9) (pred_3 ?v9 ?v1) (pred_11 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v9))))

(:action op_1
:parameters (?v9 ?v6)
:precondition (and (pred_9 ?v9) (pred_6 ?v6) 
                  (pred_1 ?v9) (pred_10 ?v6 ?v9) (pred_8 ))
:effect (and (pred_2 ?v6)
   (not (pred_10 ?v6 ?v9)) (not (pred_8 ))))


(:action op_2
:parameters (?v9 ?v10 ?v8)
:precondition (and (pred_9 ?v9) (pred_6 ?v10) (pred_6 ?v8)
                  (pred_1 ?v9) (pred_2 ?v8) (pred_10 ?v10 ?v9))
:effect (and (pred_2 ?v10) (pred_10 ?v8 ?v9)
        (not (pred_2 ?v8)) (not (pred_10 ?v10 ?v9))))

(:action op_3
:parameters (?v9 ?v6)
:precondition (and (pred_9 ?v9) (pred_6 ?v6) 
                  (pred_1 ?v9) (pred_2 ?v6))
:effect (and (pred_8 ) (pred_10 ?v6 ?v9) (not (pred_2 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_03 obj_27 obj_18 obj_08 obj_25 obj_12 obj_30 obj_11 obj_22 obj_10 obj_31 obj_29 obj_01 obj_02 obj_24 obj_28 obj_20 obj_21 obj_09 obj_19 obj_13 obj_04 obj_26 obj_23
    obj_07 obj_15 obj_05
    obj_16 obj_14 obj_06
    )

    (:init
       (pred_8)

       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_27)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_25)
       (pred_9 obj_12)
       (pred_9 obj_30)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_10)
       (pred_9 obj_31)
       (pred_9 obj_29)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_24)
       (pred_9 obj_28)
       (pred_9 obj_20)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_26)
       (pred_9 obj_23)
       (pred_5 obj_07)
       (pred_5 obj_15)
       (pred_5 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_06)

       (pred_3 obj_17 obj_25)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_03 obj_27)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_27 obj_30)
       (pred_3 obj_27 obj_18)
       (pred_3 obj_27 obj_03)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_18 obj_27)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_25 obj_10)
       (pred_3 obj_25 obj_12)
       (pred_3 obj_25 obj_17)
       (pred_3 obj_12 obj_31)
       (pred_3 obj_12 obj_30)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_25)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_30 obj_11)
       (pred_3 obj_30 obj_27)
       (pred_3 obj_30 obj_12)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_30)
       (pred_3 obj_22 obj_02)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_10 obj_24)
       (pred_3 obj_10 obj_31)
       (pred_3 obj_10 obj_25)
       (pred_3 obj_31 obj_28)
       (pred_3 obj_31 obj_29)
       (pred_3 obj_31 obj_12)
       (pred_3 obj_31 obj_10)
       (pred_3 obj_29 obj_20)
       (pred_3 obj_29 obj_01)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_29 obj_31)
       (pred_3 obj_01 obj_21)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_29)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_22)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_24 obj_19)
       (pred_3 obj_24 obj_28)
       (pred_3 obj_24 obj_10)
       (pred_3 obj_28 obj_13)
       (pred_3 obj_28 obj_20)
       (pred_3 obj_28 obj_31)
       (pred_3 obj_28 obj_24)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_20 obj_21)
       (pred_3 obj_20 obj_29)
       (pred_3 obj_20 obj_28)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_01)
       (pred_3 obj_21 obj_20)
       (pred_3 obj_09 obj_23)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_19 obj_13)
       (pred_3 obj_19 obj_24)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_28)
       (pred_3 obj_13 obj_19)
       (pred_3 obj_04 obj_26)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_26 obj_23)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_26 obj_04)
       (pred_3 obj_23 obj_09)
       (pred_3 obj_23 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_27)
       (pred_12 obj_03)
       (pred_7  obj_10 obj_07)
       (pred_7  obj_27 obj_15)
       (pred_7  obj_03 obj_05)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_11 obj_25)
       (pred_11 obj_12)
       (pred_11 obj_30)
       (pred_11 obj_11)
       (pred_11 obj_22)
       (pred_11 obj_31)
       (pred_11 obj_29)
       (pred_11 obj_01)
       (pred_11 obj_02)
       (pred_11 obj_24)
       (pred_11 obj_28)
       (pred_11 obj_20)
       (pred_11 obj_21)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_13)
       (pred_11 obj_04)
       (pred_11 obj_26)
       (pred_11 obj_23)

       (pred_4  obj_16 obj_07)
       (pred_4  obj_14 obj_15)
       (pred_4  obj_06 obj_05)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_06 obj_18)
       (pred_1 obj_13)
    )

    (:goal (and
       (pred_10 obj_16 obj_23)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_5 obj_13 obj_28)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_28)
   goals met: 0 of 1
2. (op_1 obj_28 obj_16)
   deleted: (pred_10 obj_16 obj_28) (pred_8)
   added: (pred_2 obj_16)
   goals met: 0 of 1
3. (op_5 obj_28 obj_20)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_20)
   goals met: 0 of 1
4. (op_5 obj_20 obj_04)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_26)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_26)
   goals met: 0 of 1
6. (op_5 obj_26 obj_23)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_23)
   goals met: 0 of 1
7. (op_3 obj_23 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_8) (pred_10 obj_16 obj_23)
   goals met: 1 of 1
